//vector 容器
#include<iostream>
#include<vector>
using namespace std;

int main()
{

    vector<int>v={1,2,3};
    cout<<"v.capacity()="<<v.capacity()<<",v.size()="<<v.size()<<endl;
//-----------------------------------------------------------------------------------------------------------
//1) vector(); //创建一个空的vector容器
    vector<int>v1;
    cout<<"v1.capacity()="<<v1.capacity()<<",v1.size()="<<v1.size()<<endl;//缺省不会分配任何空间

//-----------------------------------------------------------------------------------------------------------
//2) explicit vector(const size_t n); // 创建vector容器,元素个数为n(容量和实际大小都是n)
//explicit关键字禁止把这个构造函数当成转换函数来使用
    vector<int>v2(8);
    cout<<"v2.capacity()="<<v2.capacity()<<",v2.size()="<<v2.size()<<endl;//容量和大小都是8

//-----------------------------------------------------------------------------------------------------------
//3) vector(const vector<T>& v);//拷贝构造函数
    vector<int>v3(v);//内容和v相同
    cout<<"v3.capacity()="<<v3.capacity()<<",v3.size()="<<v3.size()<<endl;

//-----------------------------------------------------------------------------------------------------------
//4) vector(const size_t n,const T& value);//创建vector容器,元素个数为n,值均为value
    vector

//-----------------------------------------------------------------------------------------------------------
//5) vector(Iterator first,Iterator last);//用迭代器创建vector容器

//-----------------------------------------------------------------------------------------------------------
//6) vector(vector<T>&& v);//移动构造函数

//-----------------------------------------------------------------------------------------------------------
//7)vector(initializer_list<T>il);//使用统一初始化列表


//-----------------------------------------------------------------------------------------------------------


return 0;
}